In [3]:
#Alle Aufgaben
# In dieser Datei werden alle Aufgaben bearbeitet

In [4]:
#libary Imports

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
# Hier wird die kuratierte csv eingelesen

df = pd.read_csv('data/Kuratiert.csv', sep = ";", decimal =',')

In [6]:
# Aufgabe 1 - Wie viele Autos wurden verkauft?

In [7]:
# Zuerst schauen wir, wie viele Zeilen es gibt
df.shape

(1995, 7)

In [8]:
# Dann werden alle fehlenden Werte in einer Variable zugewiesen
missing_values_countdf = df.isnull().sum()

# Anschließend wird von der Gesamtanzahl der Zeilen, die Variable abgezogen, um herauszufinden, welche und wie viele Zeilen nicht leer sind.
print(1995 - missing_values_countdf)

KundeNr          1995
Alter            1995
Geschlecht       1995
Zeit             1995
Einkommen        1995
Preis            1104
Niederlassung    1995
dtype: int64

In [9]:
# Antwort: Es wurden insgesamt 1104 Autos verkauft

In [10]:
# Aufgabe 2 - Was ist der Höchst-, Mindest- und Durchschnittspreis der verkauften Autos?

In [11]:
# Hier werden statistische Merkmale angezeigt
df.describe()

             Alter   Geschlecht         Zeit      Einkommen          Preis
count  1995.000000  1995.000000  1995.000000    1995.000000    1104.000000
mean     50.158396     0.611028    40.262657   59104.923060   88975.198714
std      11.913807     0.487639    11.621591   16209.529474   24464.067781
min      30.000000     0.000000     3.000000   14547.000000   21471.650000
25%      40.000000     0.000000    32.000000   47093.000000   70609.422500
50%      51.000000     1.000000    40.000000   59104.513014   88931.455000
75%      61.000000     1.000000    48.000000   70639.675007  107093.375000
max      70.000000     1.000000    80.000000  100769.000000  165482.310000

In [12]:
# Antwort: 
# Höchstpreis = 165482.310000
# Mindestpreis = 21471.650000
# Durchschnittspreis = 88975.198714

In [13]:
# Aufgabe 3 - Wie hoch war der Gesamtumsatz?

In [14]:
# Alle Werte in der Spalte "Preis" werden summiert und einer Variable zugewiesen.
gesamtumsatz = df.Preis.sum()

# Anschließend wird der Wert der Variable ausgegeben
gesamtumsatz

98228619.38

In [15]:
# Antwort: Der Gesamtumsatz war 98.228.619,38 €

In [16]:
# Aufgabe 4 - Wie viele Autos wurden pro Bundesland verkauft?

In [49]:
# Alle Werte in "Preis" einer jeweiligen "Niederlassung" werden gezählt.
aufgabe_4 = df.groupby("Niederlassung")[["Preis"]].count().reset_index()

aufgabe_4

#In der spalte Preis findet man wie viele Autos in der jeweiligen Niederlassung verkauft wurden

          Niederlassung  Preis
0     Baden-Württemberg    205
1                Bayern    188
2                Berlin    126
3           Brandenburg     37
4            Düsseldorf      1
5               Hamburg     43
6                Hessen     96
7         Niedersachsen     96
8   Nordrhein-Westfalen    174
9               Sachsen     89
10            Thüringen     49

In [50]:
#Ein test um sicher zu gehen dass die bisherigen Werte stimmen
#Summe der verkäufe der Niederlassungen muss Summe der gesamten Verkäufe entsprächen.
aufgabe_4.Preis.sum()
#Deckt sich mit bisherigen ergebnissen

1104

In [17]:
#Aufgabe 5 - Wie hoch war der durchschnittliche Umsatz pro Bundesland

In [56]:
# Es wird der Durschnitt aller Werte der jeweiligen Niederlassung berechnet.
aufgabe_5 = df.groupby("Niederlassung")[["Preis"]].mean().reset_index()
aufgabe_5
#In der Spalte "Preis" stehen alle Durschnitswerte der jeweiligen Niederlassungen.

          Niederlassung          Preis
0     Baden-Württemberg   90969.560000
1                Bayern   89344.313245
2                Berlin   89584.984048
3           Brandenburg   86673.640811
4            Düsseldorf  120215.500000
5               Hamburg   85549.499070
6                Hessen   85864.929479
7         Niedersachsen   87963.312500
8   Nordrhein-Westfalen   88451.758103
9               Sachsen   89455.080674
10            Thüringen   90816.994082

In [ ]:
#Aufgabe 6 - In welchem Bundesland wurde das teuerste Auto verkauft?

In [58]:
# Es wird der Mximalwert der jeweiligen Niederlassungen ausgegeben.
aufgabe_6 = df.groupby("Niederlassung")[["Preis"]].max().reset_index()

#Hier geben wir den Maximalwert der Niederlassungen aus. Also das Bundesland, das das Teuerste Auto verkauft hat.
aufgabe_6.max()

Niederlassung    Thüringen
Preis            165482.31
dtype: object

In [ ]:
#Aufgabe 7 - Haben mehr Frauen oder Männer unsere Autos gekauft?

In [70]:
# Geschlecht gruppiert nach anzahl an Preis einträgen.
aufgabe_7 = df.groupby("Geschlecht")[["Preis"]].count().reset_index()

#In der ausgabe erkennt man dass Frauen (0) 400 mal ein Auto gekauft haben und Männer(1) 704 mal.

 aufgabe_7
# Männer haben mehr Autos gekauft als Frauen.

   Geschlecht  Preis
0           0    400
1           1    704

In [ ]:
# Aufgabe 8 - Wie hoch ist das Durchschnittseinkommen unserer Kunden? 
#             Wie hoch ist das Durchschnittsalter unserer Besucher?